//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

/** @file AmiUsbController.h
    AMI USB Driver Protocol definition

**/

#ifndef _USB_PROT_H
#define _USB_PROT_H

#include <Efi.h>
#include <AmiDxeLib.h>

#define EFI_USB_PROTOCOL_GUID    \
  { 0x2ad8e2d2, 0x2e91, 0x4cd1, 0x95, 0xf5, 0xe7, 0x8f, 0xe5, 0xeb, 0xe3, 0x16 }

#define AMI_USB_SMM_PROTOCOL_GUID    \
  { 0x3ef7500e, 0xcf55, 0x474f, 0x8e, 0x7e, 0x0, 0x9e, 0xe, 0xac, 0xec, 0xd2 }

GUID_VARIABLE_DECLARATION(gEfiUsbProtocolGuid,EFI_USB_PROTOCOL_GUID);

GUID_VARIABLE_DECLARATION(gAmiUsbSmmProtocolGuid,AMI_USB_SMM_PROTOCOL_GUID);

#ifndef GUID_VARIABLE_DEFINITION
#include <Protocol/BlockIo.h>

typedef union {
    VOID  *fpUHCIDescPtrs;
    VOID  *fpOHCIDescPtrs;
    VOID  *fpEHCIDescPtrs;
} DESC_PTRS;

typedef struct {
	UINT8			Flag;			
	UINT8			ReportId;
	UINT16			UsagePage;
	UINT32			ReportCount;
	UINT8			ReportSize;
	UINT32			LogicalMin;
	UINT32			LogicalMax;
    UINT32          PhysicalMax;        //(EIP127014)
    UINT32          PhysicalMin;        //(EIP127014)
    UINT8           UnitExponent;       //(EIP127014)
	UINT16 			UsageCount;
	UINT16			*Usages;
	UINT16			MaxUsages;
	UINT16			UsageMin;
	UINT16			UsageMax;
} HID_REPORT_FIELD;

typedef struct {
	UINT8 				Flag;
	UINT16				AbsMaxX; 			
	UINT16				AbsMaxY;
    UINT16          	ReportDescLen;
    UINT8				FieldCount;
	HID_REPORT_FIELD	**Fields;
} HID_REPORT;

typedef struct {
    VOID    **Buffer;
    UINT8   Head;
    UINT8   Tail;
    UINT8   MaxKey;
    UINT32  KeySize;
} KEY_BUFFER;

typedef struct _ABS_MOUSE{
    UINT8   ReportID;
    UINT8   ButtonStauts;
    UINT16  Xcoordinate;
    UINT16  Ycoordinate;
    UINT16  Pressure;
    UINT16  Max_X;
    UINT16  Max_Y;
} ABS_MOUSE;

#pragma pack(push, 1)

typedef struct {
    UINT8       DescLength;
    UINT8       DescType;
    UINT16      BcdUsb;
    UINT8       BaseClass;
    UINT8       SubClass;
    UINT8       Protocol;
    UINT8       MaxPacketSize0;
    UINT16      VendorId;
    UINT16      DeviceId;
    UINT16      BcdDevice;
    UINT8       MfgStr;
    UINT8       ProductStr;
    UINT8       SerialStr;
    UINT8       NumConfigs;
} DEV_DESC;

#pragma pack(pop)

typedef struct _HC_STRUC HC_STRUC;
typedef struct _DEV_INFO DEV_INFO;
typedef struct _DEV_DRIVER DEV_DRIVER;
typedef struct _URP_STRUC URP_STRUC;

#define AMI_USB_PORT_STAT_LOW_SPEED         0x00
#define AMI_USB_PORT_STAT_FULL_SPEED        0x01
#define AMI_USB_PORT_STAT_HIGH_SPEED        0x02

/**
    USB Host Controller structure

 Fields:   Name       Type    Description
      ------------------------------------------------------------
      bHCNumber   UINT8   Host Controller number, 1-based
      bHCType     UINT8   Host Controller Type, U/O/E HCI
      fpFrameList UINT32* Host Controller Frame List Address
      BaseAddress UINTN   Host Controller Base Address, memory (EHCI,OHCI) or IO (UHCI)
      bNumPorts   UINT8   Number of root ports, 1-based
      wBusDevFuncNum UINT16   PCI location, bus (Bits8..15), device (Bits3..7), function(bits0..2)
      fpIRQInfo   IRQ_INFO IRQ information
      stDescPtrs  DESC_PTRS   Commonly used descriptor pointers, see definition of DESC_PTRS
      wAsyncListSize  UINT16  Async. list size
      bOpRegOffset UINT8  Operation region offset
      dMaxBulkDataSize    UINT32 Maximum Bulk Transfer data size
      dHCFlag     UINT32  Host Controller flag
      bExtCapPtr  UINT8   EHCI Extended Capabilities Pointer
      bRegOfs     UINT8   EHCI Capabilities PCI register Offset
      DebugPort   UINT8   Port number of EHCI debug port
      usbbus_data VOID*   USB Bus data specific to this Host Controller
      Controller  EFI_HANDLE  EFI Handle of this controller
      pHCdp   EFI_DEVICE_PATH_PROTOCOL* Pointer to this controller's device path
**/

struct _HC_STRUC {
    UINT8           bHCNumber;
    UINT8           bHCType;
    UINT32          *fpFrameList;
    UINTN           BaseAddress;
    UINTN           BaseAddressSize;
    UINT8           bNumPorts;
    UINT16          wBusDevFuncNum;
    UINT8           Irq;
    DESC_PTRS       stDescPtrs;
    UINT16          wAsyncListSize;
    UINT8           bOpRegOffset;
    UINT32          dMaxBulkDataSize;
	UINT32			dHCSParams;
	UINT32			dHCCParams;
    UINT32          dHCFlag;
    UINT8           bExtCapPtr; // EHCI Extended Capabilities Pointer
    UINT8           DebugPort;
    VOID*           usbbus_data;
    EFI_HANDLE      Controller;
    EFI_DEVICE_PATH_PROTOCOL    *pHCdp;
    UINT8           PwrCapPtr;	//(EIP54018+)
    VOID			*PciIo;
    UINT16          Vid;
    UINT16          Did;
    EFI_HANDLE      HwSmiHandle;
    UINT16          SplitPeriodicIndex;
#if !USB_RUNTIME_DRIVER_IN_SMM
    UINT32          *FrameListPhyAddr;
    VOID            *FrameListMapping;
	UINT32			MemPoolPages;
    UINT8           *MemPoolPhyAddr;
    VOID            *MemPoolMapping;  
	UINT8			*MemPool;
	UINT32			MemBlkStsBytes;
	UINT32			*MemBlkSts;
#endif
    VOID            *IsocTds;
};

// Isochronous transfer related fields of DEV_INFO
typedef struct _DEVINFO_ISOC_DETAILS {
    UINT8       Endpoint;
    UINT16      EpMaxPkt;
    UINT8       EpMult;
    UINT32      *XferDetails;
    UINT8       *AsyncStatus;
    UINTN       XferStart;
    UINTN       XferRing;
    UINTN       XferKey;
} DEVINFO_ISOC_DETAILS;

/**
    USB Device Information Structure

 Fields:   Name       Type    Description
      ------------------------------------------------------------
  bFlag       UINT8   Device Information flags
  bDeviceType UINT8   Device Type
  wVendorId   UINT16  Device VID
  wDeviceId   UINT16  Device DID
  bDeviceAddress  UINT8   Device USB Address
  bHCNumber   UINT8   Host Controller Number this device is attached to
  bHubDeviceNumber    UINT8   USB Hub Device Number this device is attached to
  bHubPortNumber  UINT8   USB Hub Port Number this device is attached to
  bEndpointNum    UINT8   Endpoint number
  bEndpointSpeed  UINT8   Endpoint speed
  bLUN        UINT8   Device Logical Unit number
  wEndp0MaxPacket UINT16  Endpoint0 max packet size, in Bytes
  bNumConfigs UINT8   Number of configurations
  bConfigNum  UINT8   Active configuration number (0-based)
  bInterfaceNum   UINT8   Active interface number
  bAltSettingNum  UINT8   Alternate setting number (0-based)
  bCallBackIndex  UINT8   Callback function index
  fpPollTDPtr     UINT8*  Polling TD pointer
  fpPollTEPtr     UINT8*  Polling ED pointer
  bHubNumPorts    UINT8   Hub # of ports (USB hubs only)
  bHubPowerOnDelay    UINT8 Hub power-on delay (USB hubs only)
  fpLUN0DevInfoPtr    DEV_INFO* Pointer to Lun0 device (for multiple-LUN devices)
  wDataIn/OutSync   UINT16   toggle tracking information
  bStorageType    UINT8   USB_MASS_DEV_ARMD, USB_MASS_DEV_HDD, etc.
  wIntMaxPkt  UINT16  Interrupt Max Packet size, in Bytes
  bPresent    UINT8   Device presence indicator
  bIntEndpoint    UINT8   Interrupt endpoint number
  bBulkInEndpoint UINT8   Bulk-In endpoint number
  bBulkOutEndpoint    UINT8   Bulk-Out endpoint number
  bProtocol   UINT8   Protocol
  wEmulationOption    UINT16  USB Mass Storage Drive Emulation Option, from Setup
  bHiddenSectors  UINT8   Number of hidden sectors, for USB mass storage devices only
  bSubClass   UINT8   Device sub-class
  wBlockSize  UINT16  USB Mass Storage Device block size, in Bytes
  dMaxLba     UINT32  USB Mass Storage Device Maximum LBA number
  bHeads      UINT8   USB Mass Storage Device # of heads
  bSectors    UINT8   USB Mass Storage Device # of sectors
  wCylinders  UINT16  USB Mass Storage Device # of cylinders
  bNonLBAHeads UINT8   USB Mass Storage Device # of heads reported in Non-LBA (CHS) functions
  bNonLBASectors  UINT8   USB Mass Storage Device # of sectors reported in Non-LBA (CHS) functions
  wNonLBACylinders    UINT16  USB Mass Storage Device # of cylinders reported in Non-LBA (CHS) functions
  bEmuType    UINT8   USB Mass Storage Device emulation type
  bPhyDevType UINT8   USB Mass Storage Device physical type
  bMediaType  UINT8   USB Mass Storage Device media type
  bDriveNumber    UINT8   USB Mass Storage Device INT13 drive number
  wBulkInMaxPkt   UINT16  USB Mass Storage Device Bulk-In max packet size, in Bytes
  wBulkOutMaxPkt  UINT16  USB Mass Storage Device Bulk-Out max packet size, in Bytes
  wIncompatFlags  UINT16  USB Mass Storage Device Incompatibility flags
  MassDev     VOID*   USB Mass Storage Device EFI handle
  fpDeviceDriver  DEV_DRIVER*   Device driver pointer
  bLastStatus UINT8   Last transaction status
  pExtra      UINT8*  Pointer to extra device specific data
  UINT32      UINT8   USB Mass Storage Device # of heads
  Handle      UINT32[2]   USB Device Handle
**/
struct _DEV_INFO {
    UINT32      Flag;          //00
    UINT8       bDeviceType;    //01
    UINT16      wVendorId;      //02
    UINT16      wDeviceId;      //04
    UINT8       bDeviceAddress; //06

    UINT8       bHCNumber;      //07
    UINT8       bHubDeviceNumber;   //08
    UINT8       bHubPortNumber; //09
//    UINT8       bEndpointNum;   //0A //(EIP70933-)
    UINT8       bEndpointSpeed; //0B
    UINT8       bLUN;           //0C
    UINT16      wEndp0MaxPacket;//0D
//    UINT8       bNumConfigs;    //0F
    UINT8       bConfigNum;     //10
    UINT8       bInterfaceNum;  //11
    UINT8       bAltSettingNum; //12

    UINT8       bCallBackIndex; //13
    UINT8       *fpPollTDPtr;   //14
    UINT8       *fpPollEDPtr;   //18

    UINT8       bHubNumPorts;   //1C
    UINT8       bHubPowerOnDelay;//1D

    struct _DEV_INFO *fpLUN0DevInfoPtr; //1E
//    UINT8       bDataSync;      //22

    UINT16      wDataInSync;    // 22
    UINT16      wDataOutSync;   // 24
    UINT8       bStorageType;   // 26, USB_MASS_DEV_ARMD, USB_MASS_DEV_HDD, etc.
    UINT16      IntInMaxPkt;     //27
    UINT8       IntInEndpoint;   //2A
    UINT16      IntOutMaxPkt;
    UINT8       IntOutEndpoint;
    UINT8       bBulkInEndpoint;
    UINT8       bBulkOutEndpoint;

    UINT8       bBaseClass;     // BASE_CLASS_HID, BASE_CLASS_MASS_STORAGE or BASE_CLASS_HUB
    UINT8       bSubClass;
    UINT8       bProtocol;          //
    UINT16      wEmulationOption;   //
    UINT8       bHiddenSectors;     //

    UINT16      wBlockSize;         //
    UINT64      MaxLba;            //
    UINT16      Heads;             //
    UINT8       bSectors;           //
    UINT16      wCylinders;         //
    UINT16      NonLBAHeads;       //
    UINT8       bNonLBASectors;     //
    UINT16      wNonLBACylinders;   //
    UINT8       bEmuType;           //
    UINT8       bPhyDevType;        //
    UINT8       bMediaType;         //
    UINT8       bDriveNumber;       //
    UINT16      wBulkInMaxPkt;      //
    UINT16      wBulkOutMaxPkt;     //
    UINT16      wIncompatFlags;     //
