//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

/** @file Xhci.h
    XHCI equates and structure definitions

**/

#ifndef _XHCI_H_
#define _XHCI_H_

#include <Token.h>
#include "UsbKbd.h"

#pragma pack(push, 1)

// XHCI Device Context structures
//---------------------------------------------------------------------------

typedef struct {
    UINT64  ScratchpadBufArrayPtr;
    UINT64  DevCntxtAddr[255];
} XHCI_DCBAA;   // Total size is 256 64-bit entries, or 2K Bytes (section 6.1)

// XHCI PCI Configuration Registers
//---------------------------------------------------------------------------

// Serial Bus Release Number Register
#define XHCI_PCI_SBRN   0x60

// Frame Length Adjustment Register
#define XHCI_PCI_FLADJ  0x61

// Host Controller Capability Registers
//---------------------------------------------------------------------------

typedef struct {
    UINT32  MaxSlots    : 8;    // Number of Device Slots
    UINT32  MaxIntrs    : 11;   // Number of Interrupters
    UINT32  Rsvd        : 5;    // Reserved
    UINT32  MaxPorts    : 8;    // Number of ports
} HCSPARAMS1;

typedef struct {
    UINT32  Ist         : 4;            // Isochronous Scheduling Threshold
    UINT32  ErstMax     : 4;            // Event Ring Segment Table Max
    UINT32  Rsvd        : 13;
    UINT32  MaxScratchPadBufsHi   : 5;  // Max Scratchpad Buffers (Max Scratchpad Bufs Hi).
    UINT32  Spr         : 1;            // Scratchpad restore
    UINT32  MaxScratchPadBufsLo   : 5;  // Max Scratchpad Buffers (Max Scratchpad Bufs Lo).
} HCSPARAMS2;

typedef struct {
    UINT32  U1DevExitLatency    : 8;    // Worst case latency of U1->U0, mks
    UINT32  Rsvd                : 8;    
    UINT32  U2DevExitLatency    : 16;   // Worst case latency of U2->U0, mks
} HCSPARAMS3;

typedef struct {
    UINT32  Ac64        : 1;    // 64-bit Addressing Capability
    UINT32  Bnc         : 1;    // Bandwidth Negotiation Capability
    UINT32  Csz         : 1;    // Context data structures width (32 or 64 bit)
    UINT32  Ppc         : 1;    // Power Port Control
    UINT32  Pind        : 1;    // Port Indicators
    UINT32  Lhrc        : 1;    // Light HC Reset Capability
    UINT32  Ltc         : 1;    // Latency Tolerance Capability
    UINT32  Nss         : 1;    // No Secondary SID Support
    UINT32  Pae         : 1;    // Parse All Event Data
    UINT32  Spc         : 1;    // Stopped - Short Packet Capability
    UINT32  Sec         : 1;    // Stopped EDTLA Capability
    UINT32  Cfc         : 1;    // Contiguous Frame ID Capability
    UINT32  MaxPsaSize  : 4;    // Maximum Primary Stream Array Size
    UINT32  Xecp        : 16;   // xHCI Extended Capabilities Pointer
} HCCPARAMS1;

typedef struct {
    UINT32  U3c         : 1;    // U3 Entry Capability
    UINT32  Cmc         : 1;    // Configure Endpoint Command Max Exit Latency Too Large Capability
    UINT32  Fsc         : 1;    // Force Save Context Capability
    UINT32  Ctc         : 1;    // Compliance Transition Capability
    UINT32  Lec         : 1;    // Large ESIT Payload Capability
    UINT32  Cic         : 1;    // Configuration Information Capability
    UINT32  Rsvd        : 26;
} HCCPARAMS2;

typedef struct {
    UINT8           CapLength;      // 00
    UINT8           Rsvd;           // 01
    UINT16          HciVersion;     // 02
    HCSPARAMS1      HcsParams1;     // 04
    HCSPARAMS2      HcsParams2;     // 08
    HCSPARAMS3      HcsParams3;     // 0C
    HCCPARAMS1      HccParams1;      // 10
    UINT32          DbOff;          // 14
    UINT32          RtsOff;         // 18
    HCCPARAMS2      HccParams2;     // 1C
} XHCI_HC_CAP_REGS;

//
// Capability registers offset
//
#define XHCI_CAPLENGTH_OFFSET               0x00 // Capability Register length
#define XHCI_HCIVERSION_OFFSET              0x02 // Interface Version Number
#define XHCI_HCSPARAMS1_OFFSET              0x04 // Structural Parameters 1
#define XHCI_HCSPARAMS2_OFFSET              0x08 // Structural Parameters 2
#define XHCI_HCSPARAMS3_OFFSET              0x0c // Structural Parameters 3
#define XHCI_HCCPARAMS1_OFFSET              0x10 // Capability Parameters 1
#define XHCI_DBOFF_OFFSET                   0x14 // Doorbell Offset
#define XHCI_RTSOFF_OFFSET                  0x18 // Runtime Register Space Offset
#define XHCI_HCCPARAMS2_OFFSET              0x1C // Capability Parameters 2

//-----------------------------------------------------------
// Host Controller Operational Registers
//-----------------------------------------------------------
typedef struct {
    union {
        UINT32  AllBits;    // can be used for clearing status
        struct {
            UINT32      RunStop : 1;
            UINT32      HcRst   : 1;    // HC Reset
            UINT32      Inte    : 1;    // Interrupter Enable
            UINT32      HsEe    : 1;    // Host System Error Enable
            UINT32      Rsvd    : 3;
            UINT32      LhcRst  : 1;    // Light Host Controller Reset
            UINT32      Css     : 1;    // Controller Save State
            UINT32      Crs     : 1;    // Controller Restore State
            UINT32      Ewe     : 1;    // Enable Wrap Event
            UINT32      Eu3S    : 1;    // Enable U3 MFINDEX Stop
            UINT32      Rsvd1   : 20;
        } Field;
    };
} XHCI_USBCMD;

#define XHCI_CMD_RS         BIT0
#define XHCI_CMD_HCRST      BIT1
#define XHCI_CMD_INTE       BIT2
#define XHCI_CMD_HSEE       BIT3
#define XHCI_CMD_LHCRST     BIT4

typedef struct {
    union {
        UINT32  AllBits;    // can be used for clearing status
        struct {
            UINT32      HcHalted    : 1;
            UINT32      Rsvd1       : 1;
            UINT32      Hse         : 1;    // Host System Error
            UINT32      Eint        : 1;    // Event Interrupt
            UINT32      Pcd         : 1;    // Port Change Detect
            UINT32      Rsvd2       : 3;
            UINT32      Sss         : 1;    // Save State Status
            UINT32      Rss         : 1;    // Restore State Status
            UINT32      Sre         : 1;    // Save/Restore Error
            UINT32      Cnr         : 1;    // Controller Not Ready
            UINT32      Hce         : 1;    // Host Controller Error
            UINT32      Rsvd3       : 19;
        } Field;
    };
} XHCI_USBSTS;

#define XHCI_STS_HALTED                 BIT0
#define XHCI_STS_HOSTSYSTEM_ERROR       BIT2
#define XHCI_STS_EVT_INTERRUPT          BIT3
#define XHCI_STS_PCD                    BIT4
#define XHCI_STS_SSS                    BIT8
#define XHCI_STS_RSS                    BIT9
#define XHCI_STS_SRE                    BIT10
#define XHCI_STS_CNR                    BIT11
#define XHCI_STS_HCE                    BIT12

typedef struct {
    UINT32      Rcs         : 1;    // Ring Cycle State
    UINT32      Cs          : 1;    // Command Stop
    UINT32      Ca          : 1;    // Command Abort
    UINT32      Crr         : 1;    // Command Ring Running
    UINT32      Rsvd        : 2;
    UINT32      CrPointer   : 26;   // Command Ring Pointer
} XHCI_CRCR;

#define XHCI_PORT_CONNECT   BIT0
#define XHCI_PORT_ENABLE    BIT1
#define XHCI_PORT_RESET     BIT4
#define XHCI_PORT_RESET_CHG BIT21


// Port speed definitions as read from PortSpeed field of PORTSC
#define XHCI_DEVSPEED_UNDEFINED         0
#define XHCI_DEVSPEED_FULL              1
#define XHCI_DEVSPEED_LOW               2
#define XHCI_DEVSPEED_HIGH              3
#define XHCI_DEVSPEED_SUPER             4
#define XHCI_DEVSPEED_SUPER_PLUS        5

// Port link definitions
#define	XHCI_PORT_LINK_U0				0
#define	XHCI_PORT_LINK_U1				1
#define	XHCI_PORT_LINK_U2				2
#define	XHCI_PORT_LINK_U3				3
#define	XHCI_PORT_LINK_DISABLED			4
#define	XHCI_PORT_LINK_RXDETECT			5
#define	XHCI_PORT_LINK_INACTIVE			6
#define	XHCI_PORT_LINK_POLLING			7
#define	XHCI_PORT_LINK_RECOVERY			8
#define	XHCI_PORT_LINK_HOT_RESET		9
#define	XHCI_PORT_LINK_COMPLIANCE_MODE	10
#define	XHCI_PORT_LINK_TEST_MODE		11
#define	XHCI_PORT_LINK_RESUME			15

typedef struct {
    union {
        UINT32  AllBits;    // can be used for clearing status
        struct {
            UINT32      Ccs         : 1;    // 0 Current Connect Status - RO
            UINT32      Ped         : 1;    // 1 Port Enabled/Disabled  - RW1CS
            UINT32      RsvdZ1      : 1;    // 2
            UINT32      Oca         : 1;    // 3 Over-current Active     - RO
            UINT32      Pr          : 1;    // 4 Port Reset              - RW1S
            UINT32      Pls         : 4;    // 5..8 Port Link State      - RWS
            UINT32      Pp          : 1;    // 9 Port Power              - RWS
            UINT32      PortSpeed   : 4;    // 10..13 Port Speed         - RO
            UINT32      Pic         : 2;    // 14..15 Port Indicator Ctl - RWS
            UINT32      Lws         : 1;    // 16 Port Link State Write Strobe - RW
            UINT32      Csc         : 1;    // 17 Connect Status Change  - RW1CS
            UINT32      Pec         : 1;    // 18 Port Enabled/Disabled Change - RW1CS
            UINT32      Wrc         : 1;    // 19 Warm Port Reset Change - RW1CS/RsvdZ
            UINT32      Occ         : 1;    // 20 Over-current Change    - RW1CS
            UINT32      Prc         : 1;    // 21 Port Reset Change      - RW1CS
            UINT32      Plc         : 1;    // 22 Port Link State Change - RW1CS
            UINT32      Cec         : 1;    // 23 Port Config Error Change  - RW1CS/RsvdZ
            UINT32      Cas      	: 1;    // 24 Cold Attach Status     - RO
            UINT32      Wce         : 1;    // 25 Wake on Connect Enable      - RWS
            UINT32      Wde         : 1;    // 26 Wake on Disconnect Enable   - RWS
            UINT32      Woe         : 1;    // 27 Wake on Over-current Enable - RWS
            UINT32      RsvdZ2      : 2;    // 28..29
            UINT32      Dr          : 1;    // 30 Device Removable (0 removable) - RO
            UINT32      Wpr         : 1;    // 31 Warm Port Reset - RW1S/RsvdZ
        } Field;
    };
} XHCI_PORTSC;

#define XHCI_PCS_CCS    BIT0
#define XHCI_PCS_PED    BIT1
#define XHCI_PCS_OCA    BIT3
#define XHCI_PCS_PR     BIT4
#define XHCI_PCS_PP     BIT9
#define XHCI_PCS_LWS    BIT16
#define XHCI_PCS_CSC    BIT17
#define XHCI_PCS_WRC    BIT19
#define XHCI_PCS_PRC    BIT21
#define XHCI_PCS_WPR    BIT31

typedef struct {
    XHCI_USBCMD UsbCmd;     // 00
    XHCI_USBSTS UsbSts;     // 04
    UINT32      PageSize;   // 08
    UINT8       Rsvd1[8];   // 0C
    UINT32      DnCtrl;     // 14 Device Notification Control
    UINT64      Crcr;       // 18 Command Ring Control
    UINT8       Rsvd2[16];  // 20
    UINT64      DcbAap;     // 30 Device Context Base Address Array Pointer
    UINT32      Config;     // 38 Max Device Slots Enabled
} XHCI_HC_OP_REGS;

//
// Operational registers offset
//
#define XHCI_USBCMD_OFFSET                  0x0000 // USB Command Register Offset
#define XHCI_USBSTS_OFFSET                  0x0004 // USB Status Register Offset
#define XHCI_PAGESIZE_OFFSET                0x0008 // USB Page Size Register Offset
#define XHCI_DNCTRL_OFFSET                  0x0014 // Device Notification Control Register Offset
#define XHCI_CRCR_OFFSET                    0x0018 // Command Ring Control Register Offset
#define XHCI_DCBAAP_OFFSET                  0x0030 // Device Context Base Address Array Pointer Register Offset
#define XHCI_CONFIG_OFFSET                  0x0038 // Configure Register Offset
#define XHCI_PORTSC_OFFSET                  0x0400 // Port Status and Control Register Offset


#define CRCR_RING_CYCLE_STATE	BIT0
